USE exercise;

-- テーブル: 気象観測
CREATE TABLE IF NOT EXISTS 気象観測 (
    月 INTEGER,
    降水量 INTEGER,
    最高気温 INTEGER,
    最低気温 INTEGER,
    湿度 INTEGER
);

-- 初期化（テーブルのデータを削除）
SET FOREIGN_KEY_CHECKS = 0; -- 外部キー制約を一時無効化

TRUNCATE TABLE 気象観測;

SET FOREIGN_KEY_CHECKS = 1; -- 外部キー制約を再有効化

-- データ挿入: 気象観測
INSERT INTO 気象観測 (月, 降水量, 最高気温, 最低気温, 湿度) VALUES
(1, 31, 11, -1, 43),
(2, 115, 13, -3, 49),
(3, 142, 20, -1, 59),
(4, 118, 30, 1, 63),
(5, 44, 30, 6, 65),
(6, 236, 32, 16, 73),
(7, 333, 37, 18, 75),
(8, 100, 37, 21, 69),
(9, 140, 34, 17, NULL),
(10, 88, 28, 8, 65),
(11, 120, 19, 2, 58),
(12, 44, 14, -2, 50);
