USE exercise;

-- テーブル: 入退室管理
CREATE TABLE IF NOT EXISTS 入退室管理 (
    日付 DATE NOT NULL,
    退室 CHAR(1),
    社員名 VARCHAR(20) NOT NULL,
    事由区分 CHAR(1)
);

-- 初期化（テーブルのデータを削除）
SET FOREIGN_KEY_CHECKS = 0; -- 外部キー制約を一時無効化

TRUNCATE TABLE 入退室管理;

SET FOREIGN_KEY_CHECKS = 1; -- 外部キー制約を再有効化

-- データ挿入: 入退室管理
INSERT INTO 入退室管理 (日付, 退室, 社員名, 事由区分) VALUES
('2022-01-31', '1', '菅原', '1'),
('2022-02-01', '1', '菅原', '1'),
('2022-02-02', '1', '湊', '2'),
('2022-02-05', '1', '朝香', '3'),
('2022-02-05', '1', '菅原', '3'),
('2022-02-08', '1', '湊', '9'),
('2022-02-09', '1', '菅原', '1'),
('2022-02-10', '1', '菅原', '1'),
('2022-02-11', '1', '菅原', '1'),
('2022-02-12', '1', '菅原', '1'),
('2022-02-13', '1', '菅原', '3'),
('2022-02-13', '1', '湊', '3'),
('2022-02-13', '1', '朝香', '3'),
('2022-02-14', '1', '菅原', '1'),
('2022-02-15', '1', '菅原', '1'),
('2022-02-16', '1', '菅原', '1'),
('2022-02-17', '1', '朝香', '3'),
('2022-02-18', '1', '菅原', '3'),
('2022-02-19', '1', '湊', '9'),
('2022-02-20', NULL, '湊', '9'),
('2022-02-20', NULL, '朝香', '9');